<template>
  <div class="content-wrapper">
    <h1 class="theme-title">Задания по теме "Роутер"</h1>

    <h3>
      Задача 1: <br />
      - Добавить навигацию в хедер;<br />
      - Настроить роутер и навигацию по страницам;<br />
      - В адресной строке не должно быть хеша;<br />
      - Активному пункту меню добавить активный класс;<br />
    </h3>
    <br /><br />

    <h2>Тема: Динамические роуты</h2>
    <br />
    <h3>
      Задача 2: <br />
      - <br />
      - <br />
      - <br />
    </h3>
    <br /><br />
  </div>
</template>

<script>
export default {};
</script>

<style></style>
