<template>
  <div class="content-wrapper">
    <h1 class="theme-title">Задания по теме "Роутер"</h1>
    <h2>Тема: Настройка роутера</h2>
    <br />

    <h3>
      Задача 1: <br />
      - Добавить навигацию в хедер;<br />
      - Настроить роутер и навигацию по страницам;<br />
      - В адресной строке не должно быть хеша;<br />
      - Активному пункту меню добавить активный класс;<br />
    </h3>
    <br /><br />

    <h2>Тема: Динамические роуты</h2>
    <br />
    <h3>
      Задача 2: <br />
      - В компоненте AppDinamicRoutes.vue в цикле создать ссылки <br />
      - Зарегистрировать динамические роуты для компонента AppCarDinamic.vue <br />
      - Вывести динамически компонент AppCarDinamic.vue под меню в компоненте AppDinamicRoutes.vue <br />
      - В компоненте AppCarDinamic.vue должен выводиться текст: "Автомобиль + название автомобиля" <br />
    </h3>
    <br /><br />

    <h2>Тема: Программная навигация</h2>
    <br />
    <h3>
      Задача 3: <br />
      - В компоненте AppCarDinamic.vue создать кнопку "Назад" <br />
      - При клике по этой кнопке нужно перейти на страницу "dinamic-routes" <br />
      - Сделать то же самое с тегом "router-link" <br />
    </h3>
    <br /><br />

    <h2>Тема: Вложенные роуты + Передача параметров</h2>
    <br />
    <h3>
      Задача 4: <br />
      - В компоненте AppCarDinamic.vue создать кнопку "Показать полную информацию" (используя router-link) <br />
      - При клике по этой кнопке в под чертой нужно отрисовать компонент AppCarFullInfo.vue с полным описание машины <br />
      - В компонент AppCarFullInfo.vue динамически передать параметры машины <br />
      - Ссылку для отрисовки компонента передать в виде строки и через свойство "name" в router <br />
    </h3>
    <br /><br />

    <h2>Тема: Прокрутка страницы (Scroll)</h2>
    <br />
    <h3>
      Задача 5: <br />
      - В компоненте AppCarFullInfo.vue создать кнопку "Прокрутить к элементу" <br />
      - При клике по этой кнопке необходимо плавно прокрутить компонент AppCarFullInfo.vue к блоку с полным описание машины <br />
    </h3>
    <br /><br />
  </div>
</template>

<script>
export default {};
</script>

<style></style>
